{"format": "graph-model", "generatedBy": "2.0.0-dev20190527", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "default", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/permute/inverse/InvertPermutation", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module/real_nvp_default_template_2/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_2/dense_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}}}, {"name": "module/real_nvp_default_template_2/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_2/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_2/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_2/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_1/dense_2/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module/real_nvp_default_template_1/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_1/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_1/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_1/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_1/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/real_nvp_default_template_3/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator/inverse/LinearOperatorScaledIdentity/solve/LinearOperatorScaledIdentity/solve/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/Neg", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MultivariateNormalDiag/range", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/Normal/log_prob/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Normal/log_prob/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/Shape_1", "op": "Shape", "input": ["default"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/split", "op": "Split", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim", "default"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/strided_slice_1", "op": "StridedSlice", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/Shape_1", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/split", "module/real_nvp_default_template/dense/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/ones", "op": "Fill", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/strided_slice_1", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/MatMul", "module/real_nvp_default_template/dense/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/LeakyRelu", "op": "LeakyRelu", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/BiasAdd"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense/LeakyRelu", "module/real_nvp_default_template/dense_1/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/MatMul", "module/real_nvp_default_template/dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/LeakyRelu", "op": "LeakyRelu", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/BiasAdd"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_2/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_1/LeakyRelu", "module/real_nvp_default_template/dense_2/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_2/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_2/MatMul", "module/real_nvp_default_template/dense_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/split", "op": "Split", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/sub", "op": "Sub", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/split:1", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/Neg", "op": "Neg", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/Sum", "op": "Sum", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/real_nvp_default_template/split:1", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/Exp", "op": "Exp", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/Neg", "op": "Neg", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/mul", "op": "Mul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/Exp", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/mul", "op": "Mul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/ones", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/concat", "op": "ConcatV2", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/split", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/mul", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/add", "op": "Add", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp/inverse_log_det_jacobian/mul", "module_apply_default/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/permute/inverse/GatherV2", "op": "GatherV2", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/concat", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/permute/inverse/InvertPermutation", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/Shape", "op": "Shape", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp/inverse/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/split", "op": "Split", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/permute/inverse/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Shape", "op": "Shape", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/permute/inverse/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/strided_slice", "op": "StridedSlice", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/Shape", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/split", "module/real_nvp_default_template_1/dense/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/strided_slice", "op": "StridedSlice", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Shape", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/strided_slice/stack"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/ones", "op": "Fill", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/strided_slice", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/MatMul", "module/real_nvp_default_template_1/dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/ones", "op": "Fill", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/strided_slice", "module_apply_default/MultivariateNormalDiag/log_prob/affine_linear_operator_1/inverse_log_det_jacobian/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/mul", "op": "Mul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/ones", "module_apply_default/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/LeakyRelu", "op": "LeakyRelu", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/add_1", "op": "Add", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/add", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/permute/inverse_log_det_jacobian/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense/LeakyRelu", "module/real_nvp_default_template_1/dense_1/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/MatMul", "module/real_nvp_default_template_1/dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/LeakyRelu", "op": "LeakyRelu", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_2/MatMul", "op": "MatMul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_1/LeakyRelu", "module/real_nvp_default_template_1/dense_2/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_2/BiasAdd", "op": "BiasAdd", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_2/MatMul", "module/real_nvp_default_template_1/dense_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/split", "op": "Split", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/sub", "op": "Sub", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/split:1", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/Neg", "op": "Neg", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Sum", "op": "Sum", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/real_nvp_default_template_1/split:1", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_3/inverse/real_nvp_default_template/split/split_dim"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/Exp", "op": "Exp", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Neg", "op": "Neg", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/mul", "op": "Mul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/Exp", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/mul", "op": "Mul", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/Neg", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/concat", "op": "ConcatV2", "input": ["module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_1/inverse_log_det_jacobian/real_nvp_3/inverse_log_det_jacobian/split", "module_apply_default/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvpMultivariateNormalDiag/log_prob/chain_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp_of_permute_of_real_nvp/inverse/real_nvp_1/inverse/mul", 